<pad>
<s>
<unk>
</s>
520477
816903
1033823
995362
920327
834740
460600
54111
1226448
1025743
990423
526298
766772
441513
655201
930754
300241
477703
596474
133940
701424
422098
1163183
490774
325497
487337
1071452
876555
490535
1134165
1019141
1253787
1080587
39765
553856
105283
323159
572782
63641
49805
166959
598948
1275770
454003
1091199
966562
235896
541144
386932
918835
1121767
1207796
554251
138140
1115586
404543
658131
129533
608182
792049
355504
889228
19054
99203
739365
1097342
340401
426716
98991
599826
941047
857269
848000
878073
956848
965936
1061507
290352
796858
1000483
403305
844647
655002
184574
31046
411707
1181092
1224594
752874
524739
726082
784356
1257015
560534
201789
663450
1267351
335962
605692
874881
806785
1190978
967191
562647
824446
177456
845860
388322
183909
100078
1097161
939470
271975
1049092
186268
1057544
1145236
806755
847972
674551
1154737
1191954
796260
497735
768219
585102
703339
881054
263278
686860
915090
229783
9604
79262
427992
102499
792991
833357
830830
318929
1880
18911
272665
1122314
747560
825345
386754
1058680
1137386
1245422
366191
78141
204775
287496
520355
250930
663669
425511
764656
3849
325467
414956
628277
1134596
652252
361815
680125
102711
96614
457828
573761
1082097
1000782
200862
72103
261174
473461
778803
984580
148697
813840
1051868
762897
909264
566841
669476
1098157
788244
321830
424428
568277
1110074
730920
547191
806803
400027
203167
161601
266784
22666
693588
922318
66721
285591
529032
61571
308610
522428
680091
144973
264512
980337
265771
100833
436553
534086
716116
518787
599962
1149037
1161095
555027
703615
907296
211163
149201
174851
703473
965650
135326
1190676
481786
287730
396212
444974
501768
479552
744561
343851
1025059
683284
783781
1069083
175827
1089809
539278
490374
1078287
485807
791685
407475
1196999
211511
796795
738281
117367
491804
1038736
119099
196494
1113110
563568
660975
1097942
1251396
106993
1171995
259154
542816
536257
605219
261940
1216280
1105164
854891
1142192
1268082
416085
100382
178725
99575
168220
508008
56509
296734
947200
1258682
203457
614484
54885
587327
458209
203284
196698
1003539
1063442
1018377
446961
558713
257985
292687
1073840
913250
700444
718788
407662
713291
161631
810733
272277
552368
661494
1102131
422170
41306
1040254
601668
1081563
608869
978035
1113816
849769
302854
864963
303845
25959
769051
313684
251717
328851
829191
1167357
1022460
1037188
40563
868967
426409
66495
740921
80265
548903
452418
1279716
448557
183082
201133
437206
676782
962375
274418
1096861
848321
460809
263151
1203094
248537
1119699
346935
489884
1047796
912033
733085
299485
1194630
679740
747063
1279476
1275969
379223
715925
1256802
708375
25430
157787
885680
74138
38841
825039
405680
636415
392093
1252987
790149
1253164
7796
857131
965957
895011
910697
240714
192454
933445
18127
981354
347900
671551
989485
1077959
789842
883699
695445
933481
931304
150836
29487
970100
1232987
377764
461074
290288
494878
54059
558281
1081251
999378
228108
1270191
752991
877167
447420
1021911
732050
243774
1154287
819591
21772
309047
591366
1046814
196710
894612
1128160
1051390
686820
1254728
1198055
1001167
482014
83378
634619
434248
520259
84718
773139
889015
1120734
668425
863657
957974
1141528
954801
1040894
312698
41607
289763
170739
801760
312181
158677
620853
944337
525987
507321
1174272
28008
300557
461372
598647
1193939
112533
232680
864895
1210589
788176
448837
65431
916947
49671
482707
742713
1230376
1257332
896267
868560
828892
291779
1194371
1011979
57231
545102
220626
1119801
936318
700276
632718
1003894
546577
520506
1240749
955021
948715
399718
133905
132454
372808
273994
1070929
1141728
1272166
569782
293941
339472
1267003
228014
684859
758716
991428
130119
960860
266069
132697
712636
208979
900216
633039
8322
169362
475197
788023
110130
809940
939268
693050
799674
440061
365158
1009499
195057
154312
5820
876606
67633
1067570
1025713
432149
111874
1257748
363388
487685
1012629
40636
1266317
849059
81703
183491
718713
413137
1183198
1084266
245341
860053
336098
167073
1130795
1012908
260876
298641
110494
859563
1005033
280268
638334
723492
1232449
876740
53796
824098
216495
456154
186144
245671
1031928
444925
852447
548075
1244596
983990
498300
446167
437916
1076274
971799
1017589
335008
16008
1128683
897439
821270
652120
1271025
334227
14786
428303
1201487
670486
689292
197012
20619
525772
7500
115198
1279582
857503
30306
901377
1167295
603499
685057
209856
886244
626786
583707
377489
920910
70254
137035
659499
1016192
457012
801149
1045349
643640
718123
808039
820884
666655
299571
508687
535072
565958
386394
593574
148609
467168
1155376
1218708
157623
64250
743458
428243
257811
1227586
918956
728407
1099927
584131
499112
347165
661248
361906
622285
986650
310960
1229740
779436
527817
182180
888947
1021248
163931
545370
1112347
1027255
515948
591310
129442
966866
1159154
610495
655939
779802
1103113
317259
1140157
812370
85763
152088
621682
437936
232380
434875
66512
218413
866576
187793
653874
534314
610955
246539
809135
561904
1142270
720101
327773
887156
515268
409561
584273
704151
790045
1142343
158164
1167358
622073
1264068
1227861
352715
1155860
807357
52857
929897
463809
865012
408021
305209
42619
1016854
881493
933052
1118938
595714
774778
702966
567232
1238712
527264
101862
1105906
831037
1075136
464339
1006455
569415
835740
1272472
873962
887627
319071
614857
600366
1062522
1227562
74725
1063543
108602
1036911
317915
35579
194388
303469
1037347
19182
870892
897589
1229683
393580
882314
543051
956064
410229
48492
912348
1098675
357733
319243
633818
416291
1040693
873742
898948
1171578
547155
331522
710409
171409
416932
270091
360674
471784
1246891
63920
1105940
793858
101153
139132
508717
510429
397743
132364
892940
1093951
242626
521125
663559
647702
845405
389822
449130
397523
45002
754124
918421
402361
37748
752790
1112816
120819
984322
1144187
25690
371600
850032
210662
1212330
1233237
1108767
960230
680465
321972
1028317
912149
1157817
741559
247991
755820
1074082
1054199
572824
566120
2214
194441
469755
337842
901492
901629
482411
806905
1008883
47305
765839
431249
224294
382421
269018
649861
1150650
416100
429303
424161
630973
745799
56884
626603
563598
92953
998534
223956
518130
1181454
655828
124777
1272277
372478
890928
214186
92740
50182
814731
188650
329790
853602
1018503
713359
765514
460983
970739
200832
139754
1278146
620026
862083
780468
63058
142160
756099
514147
351343
1183294
886801
6562
1053965
729976
146389
1264372
519665
1011466
988775
576250
984673
520261
243901
444510
501973
1094941
610577
164819
12453
507248
1102102
943469
266576
568276
833984
278563
273264
897471
736115
23651
491055
1234307
211393
194731
1224379
1084243
1272567
729202
952474
28028
496803
486973
712778
684484
643062
380521
766019
1081302
1060995
508090
423541
729468
895109
250170
715598
355924
797586
970106
398816
935857
149458
996399
685593
258218
576563
1242743
444135
1107357
1177482
522362
450633
676899
62931
1197475
1198295
933482
289039
955619
1269513
29462
1266986
64381
1109510
218198
1057688
413171
1074421
684875
506496
485614
174938
1145314
897101
87727
1108311
1228539
1276397
892932
513416
655756
924874
1156796
183248
1143195
1233500
124774
1036901
95649
1194817
758923
100089
654705
549047
811205
559981
719949
974619
682413
1124339
247199
1127790
368574
677507
723244
1094593
638699
863505
1278895
774502
748896
527096
794043
679412
333771
229095
205592
876819
719477
638160
608632
954683
15841
592110
838395
874561
473420
354307
521598
1189292
402432
1257817
908963
1128634
1234416
659080
109974
348978
942401
439809
1041576
16186
637864
1157718
966953
776990
524543
482080
570889
949409
835649
1269136
146282
577712
743490
631506
205839
603094
746402
862457
576097
929269
551213
956308
430399
692084
301998
326432
176383
939594
346125
1171204
1158893
564199
207420
795824
785738
600200
280002
938853
520601
1152479
377843
1010588
413404
244780
301918
978327
754713
407991
448558
373174
419650
279204
342914
109451
105678
1132635
527644
278602
57617
856297
429547
1073687
501987
407290
885827
982084
357402
864651
867238
351277
498826
1163907
1262735
710059
94449
668068
1097425
57163
96086
541185
190067
481058
716297
37007
143205
253930
706675
259975
426307
1019439
1147925
811877
991219
1067170
108492
494674
202821
753577
1130366
1009088
161196
747180
106451
569876
347723
668981
103087
775644
1253782
207959
566976
777331
737203
329580
247448
305212
139404
537723
842907
1185637
280366
1196641
943956
761307
1255247
349512
1252645
122948
69219
167855
1101781
1207362
921586
1000015
248026
445373
998350
682
858304
1215792
1204806
714278
998233
1099626
706185
1237541
28827
193705
474807
351127
901985
609617
1125046
253760
1164129
1042056
618531
1104192
620765
604915
373367
851500
1134471
1212426
842115
1241862
968650
585440
681139
353332
346422
192091
279781
1224212
367412
652817
1240790
1108771
114606
1051465
457738
639400
1244972
235866
230580
47668
826538
69046
1148025
1154217
1190037
182481
1039033
658346
282245
1022242
157576
180244
474461
143039
818341
251102
587594
787993
1194416
1071566
26206
162254
425052
1097155
45427
588341
190034
285480
76689
1078721
1069409
655305
343688
1192804
1164182
427999
900675
960697
518717
692492
97350
384123
455719
252588
241536
1146684
719711
784330
1244102
886918
1036907
250933
113715
662660
1104318
584053
908764
615365
947501
784490
986821
330269
352476
209541
755950
1038075
114172
1162520
999910
1268049
1023665
632142
638682
1135586
465148
960078
1038656
1061562
1032936
572898
292282
345921
961479
372099
194839
290695
509769
778979
1041558
769357
817536
305515
437792
274714
709237
1241179
1004932
828795
457537
89035
141776
452459
247854
633284
354337
1024355
483164
935975
613494
437885
65859
386016
1171209
1037865
201912
153183
233929
425786
173393
389613
1196847
35131
84235
1189383
950706
631190
275305
625639
1180130
1072765
436563
597854
889545
708103
205402
60390
1277871
823858
653408
1122544
874391
424658
843088
350771
725095
1230977
265624
632534
260177
1212197
27356
1094532
506555
659038
330502
707872
938364
470398
387150
10368
478102
152938
1193686
263400
1208289
768941
448645
1213233
404446
666233
766136
782716
212561
408183
849885
153993
952122
277558
1130439
922653
606393
1053017
437672
235778
133239
529018
310106
1241652
850343
748973
925680
303011
1176494
122498
807057
434681
222382
1093423
889841
455592
460458
1206666
154885
936364
384290
897436
37356
924462
528760
1098258
345864
373093
1214182
12135
655312
902736
897475
858946
905055
969064
829899
909942
1080164
222851
275242
1253619
989951
934612
678048
528210
4987
1269852
226337
464711
1147110
257190
308034
723880
1212070
1231567
821567
388463
61898
266887
867328
535479
926111
845320
1204435
796131
500309
455304
1180505
86697
444545
168106
450949
246791
675745
1208415
483747
576500
1202100
910888
783993
613280
927311
153731
556545
1122693
102614
376996
525480
593092
827017
284146
1236191
54244
791636
990139
584339
781048
887438
1098560
293258
923831
603070
84633
626513
485399
491188
1102525
96705
880458
473974
521933
535448
877002
557146
491781
131275
1211157
42543
1221286
857530
254567
746257
977907
1087151
151450
533560
141633
50813
428287
1203883
182503
1167917
285679
1033973
822746
311201
882127
91044
238678
572455
132516
787270
22413
1129308
1259944
115869
800717
781400
567228
265652
1016186
18391
1216951
657453
1032916
222712
556638
108791
877005
433509
1014945
857546
1062461
1244312
893034
338845
806703
42109
985047
42793
739201
1249493
1242010
1054308
372872
1092226
437143
819792
344718
1053133
595566
391494
1096785
988628
907183
501257
300235
800095
303958
1191387
572675
229218
33373
919096
1119534
1264884
459953
651513
617023
335130
552213
232816
595159
57932
821973
3146
189764
445187
1108096
629837
333475
984289
404914
507139
132419
159407
1117092
1263122
666597
138047
908734
58833
245549
390431
557617
1135617
493451
600214
1099608
374562
738279
432191
59862
671335
782125
118112
1237177
561097
577019
780898
831818
566228
1228370
1140064
818896
756428
714600
934161
94560
669255
369538
783889
701158
619306
954499
1006283
509731
586983
846691
451526
822953
248150
185123
1053025
75094
1144244
575076
1142736
977873
814750
1040672
772434
536072
1271263
560195
622292
153705
496458
261549
383832
199792
339279
815647
1040914
803346
663588
1208431
15191
470727
985019
914675
373717
400928
718574
1249903
234165
831330
535596
252105
1107358
749188
919692
32538
1062608
762310
180992
174161
924433
383221
189067
1109881
1136805
231738
307483
186242
1038513
967715
952686
129638
130684
311900
1275597
311086
716843
771246
907326
876210
1147263
48166
604455
299162
934197
386190
1270052
1009412
1276065
922247
1226165
1215525
274787
1045036
451307
1211580
264050
1196947
1259086
1211274
843418
73450
238715
425328
807907
712466
1004860
1005148
242461
654946
1071880
796020
934169
349538
37754
774613
1201180
945245
1143811
868273
1016029
744480
809316
945358
989940
1266863
34638
1269938
272554
312707
30110
730480
1162557
1183505
933802
420804
289108
957148
746878
430687
940188
536630
885480
919707
167606
1062474
531723
180603
865080
266565
799164
44758
545990
648211
398177
425463
1161631
16222
711974
472612
939417
318911
226582
715950
1004279
287361
459642
851011
484507
121732
1263403
554821
630580
782236
762784
890009
680478
179657
253007
1224786
923112
50399
1074748
709624
968669
436058
164293
717686
61530
11275
433993
61867
1049531
308655
65672
261901
847492
648226
311226
43465
821890
212672
270644
608137
83442
1105101
451388
245099
725665
666749
919891
40575
627785
233053
463878
196178
19433
60716
119390
90404
914065
1053060
918715
572744
526319
973243
798252
159720
40742
425166
341797
642119
700659
986178
635819
593475
844029
639971
23439
387769
1107420
457186
579440
1159540
329123
277492
1101923
720700
39620
25813
1191547
309232
1165350
289186
471876
802416
1043187
427169
46846
628306
1028903
9815
1130423
413797
230865
886745
754689
553229
1043076
303134
439752
1137459
803569
156796
82600
592408
235862
256933
422300
1200989
385861
192204
966153
332979
1010355
1161773
632092
876127
1230878
595929
963529
351248
681465
92927
173833
846813
584919
237210
1140546
810179
856385
758724
198227
117651
193357
183732
247211
492100
171962
590467
527612
926600
1210198
456364
1030575
348277
645142
406341
371687
543604
1063992
1189728
796844
364245
25849
6475
578057
548150
447981
293100
491668
448845
479860
1228623
323103
1198698
396173
743062
1145228
1206153
11746
17539
639546
617854
1078597
715881
51846
339212
1198219
131362
1097851
561375
597526
794343
772039
970791
310464
240644
551439
402060
75222
615898
280239
12875
1174448
1138394
388567
676949
25402
1087620
49933
777290
444313
529704
463236
327386
526647
1082045
373047
1088911
832252
391463
1003387
419822
42909
489614
861156
877157
35621
933733
363566
1175126
1114749
172977
22911
456618
794790
448095
742109
768376
272017
477290
447215
176827
1138455
1234861
1175137
1141148
1258035
1145276
801241
1085111
165848
289033
512513
102804
979335
445334
1151443
298572
1247751
242594
740158
516806
535959
383151
1248614
140797
675505
129189
301620
357698
1043366
548503
578005
231649
1101945
314275
1031740
1261121
140591
853904
852638
457548
646402
834043
269901
471056
1127672
232925
1108721
1133244
91480
794821
411358
1049336
1085151
948160
771982
1115197
735823
382714
1057076
1119636
306587
824333
997845
418255
256495
279257
1088438
707520
513274
26273
460932
696458
366122
294879
347414
979215
134498
834779
191765
1105484
1144335
927723
508037
1081323
988098
281169
851412
676
289979
856212
48460
273427
194413
605151
833235
444731
362928
983716
472396
1151409
430076
426125
818809
1092157
851313
828234
660905
215740
596680
483647
374574
914774
288823
1253868
1034027
349030
81666
602389
832669
547189
557269
658352
1057520
986276
180140
873149
483574
145467
886508
1075510
1104872
152099
998232
1215074
546601
370103
498864
372364
35156
739181
272272
1179837
327735
645524
551650
1244799
71997
1166426
1116679
375318
1079725
656554
979726
689346
8811
922576
118027
301615
787329
1155801
577704
262022
453938
516703
884963
1213903
572333
616471
618722
474179
732541
128104
36241
397207
823643
1060048
606291
68762
285122
804824
17115
1260150
714782
512058
253161
842040
965182
1141670
1141713
419842
858131
1113703
927878
295014
776603
697464
364656
882843
1265005
1275937
170520
75866
784586
1272826
60376
528096
1074337
189927
803388
431505
1024976
679169
865189
801289
427207
236744
1132828
597361
75775
206819
560863
940288
1267639
206375
154835
238510
1048411
587626
90061
1256405
140908
335040
472421
106652
662080
575372
90319
1267446
927021
240651
348412
1255841
515017
610491
1029799
716616
509555
1231371
268041
330478
129706
801982
286222
960632
746354
162767
302829
1092604
113525
649968
882715
971040
240816
781932
1030460
531525
943761
240843
269136
1144792
541734
682128
960965
1071199
151477
680433
1129084
307886
1125005
1242562
1031246
1139857
1029949
805056
197563
961513
1163783
563972
334143
432640
570381
1052198
9999
270568
171651
772578
943146
30120
966655
292979
305837
1005934
1098289
323372
278094
841481
62671
1262918
94620
549022
712223
727561
97356
1220910
52926
530030
1043678
1232393
873762
577716
4184
1032585
152341
820449
120326
1068978
300428
1264486
626430
755521
670921
322986
697412
497698
622070
922826
559313
1116219
363908
586511
828333
186603
594593
359407
58607
1137305
769621
253564
577643
112529
339233
144315
186689
229756
219325
645357
475681
876870
1164633
885943
129368
32804
234386
928328
872285
955935
1225399
34904
81658
1109272
309842
242655
1011229
690186
279976
721367
82389
1009418
1210440
484936
967805
638932
150200
106568
1163362
512910
854084
32663
685384
392505
705394
357376
653865
104378
522582
397413
390331
289904
379921
449196
399525
1210003
1271195
1236927
1260924
383929
1164447
710842
497909
329104
1079865
1216763
287428
1113126
1019695
1242180
1269481
603709
574154
922853
572525
807069
1258146
561265
45062
508399
1052956
1022491
1169044
437503
437691
1062020
1104653
1055875
59282
355387
433383
1120623
792906
132826
1177425
329963
6333
748197
495141
800332
464112
71823
574715
1255308
736064
480000
629312
392399
814296
1170296
1247029
855325
672904
301382
115554
676351
418676
1106020
790876
965683
388691
1026971
415551
670748
152353
865479
796379
390288
1104675
201134
22391
1180488
81939
144299
1083216
627858
770015
1204630
183717
905885
533448
281444
181793
31072
452121
581481
435479
1152192
938813
178971
656989
381185
301225
132767
157700
232957
895430
1135491
1234532
744954
1040126
1150170
350146
658988
365759
1125911
1073196
848512
953010
266507
40165
859432
563297
1260231
264448
1242943
1154059
430183
175419
1173687
852532
14572
285030
1181643
1064701
754282
203350
196174
961312
1188445
68270
248403
510564
624018
334085
865446
364334
899498
276335
424990
412284
174548
433214
1212024
227822
1227603
193331
289249
813603
1110686
335755
608977
507470
525750
941599
274235
283174
1226666
468296
465675
555338
435671
491812
680270
318273
646051
625725
709401
829937
681223
952151
444539
222258
825261
961760
531290
514343
701611
1090251
645718
619035
212509
452935
1220858
218490
605266
428234
200579
1130055
353161
784145
29514
323697
784270
22395
275996
237289
885069
496412
597955
1278762
1133703
30314
467042
522421
196123
1141125
1184352
992233
525024
361534
847166
317689
257914
691630
1137471
524900
451648
1185190
509379
1116768
629618
1172271
478069
467554
100727
384100
251013
784983
1170354
882159
625466
1156051
398887
542187
887184
537646
165511
1226636
116318
538201
1031755
878571
1147549
125749
788734
144803
353916
713963
655971
42955
561734
157732
1263615
907218
308520
719262
577406
244656
1241031
1099624
752090
1154937
437867
996699
652324
1260524
755505
960662
987686
76154
169867
583991
834748
402043
403853
64132
34747
687489
855343
1257367
882641
140835
1109210
688349
542613
846511
1145096
125939
773259
587064
334981
67965
1003767
101159
308554
929364
719519
1228199
42872
71181
266169
1074380
1622
1223739
1222868
477373
396595
1231411
245286
115074
399118
1208425
1217886
1026848
271793
1217396
1114958
543326
1205594
409588
41552
1023345
1070640
736572
23369
1171031
998612
965669
1094395
592784
250535
349742
884994
561969
413229
375047
249694
811684
1137508
803532
823026
482003
998150
1189529
1147766
550822
802461
374759
181477
1130670
1226607
104754
412075
458927
1244408
383293
691032
510038
313396
1114803
1076928
548673
689410
303535
473664
291937
1028650
633416
813061
1270574
96599
662160
780150
296503
339946
237180
208444
1198610
707612
90540
1151792
694511
520767
1099427
729761
1229467
683991
458430
1179683
748486
773288
213787
955396
1270307
45374
1072783
695364
990184
394112
33753
979507
562661
771153
412711
763308
636918
4187
102337
273817
1153846
870251
1096337
1020584
60812
133700
785678
357242
473466
449910
866728
462569
340734
593260
8786
1215002
36689
160975
568912
1088507
1260052
876117
976063
1063907
90518
860795
1176801
1032237
1200401
1079817
1236159
314555
343840
5800
447658
1231964
597817
64275
1190139
243105
1114428
212302
489634
1171915
1094684
401048
569672
1226754
590566
613610
607413
110135
667738
385066
734170
1092382
763146
710310
739183
1158981
793816
220238
1048394
567977
1204906
974352
227376
1233323
709522
97401
813992
88139
153563
926728
791344
1087783
128289
648429
724953
713812
426521
747276
873180
189926
290599
228401
424136
425105
88101
1112052
471963
1261994
964401
242403
275962
606655
914216
1133849
184207
766094
856965
539344
490923
322088
52870
979177
747672
770212
1239626
117966
1012960
1230146
956511
118752
1053441
250402
405598
616518
9241
156973
554976
48955
202208
30095
971798
1196373
650457
155653
119406
1134055
936468
478989
376795
47430
430363
371808
158937
709495
1076832
852358
116197
727710
1272881
94281
455459
1128079
554828
223764
708231
1029497
115612
1245640
51202
1092066
52317
775454
96279
501964
789216
797158
1196671
487725
1110927
656991
479032
1179760
418411
89742
743947
84023
1070151
592860
926009
193517
561286
1062736
156850
745938
1055410
691527
492054
948653
397585
780831
509760
581925
652270
755456
1008501
1143053
665739
142079
710470
652296
993110
574591
362606
417337
464952
938682
391840
1002773
446154
729583
468112
762864
586506
916261
1203227
402393
111351
443635
291276
526989
399070
1206212
756034
571807
536993
975156
896354
972934
454050
631992
560181
1190897
1159370
929135
604472
447779
725137
828894
116344
173979
720957
403463
1032942
1270495
1161722
731793
771250
200627
656243
268051
952458
513143
235826
1259733
119159
1806
1143533
561806
437702
869658
791992
569260
152012
89919
245507
85838
763514
667940
982129
163833
410100
1233003
784888
329415
913973
85840
464039
129915
356953
629500
661884
30261
1066453
1061045
4846
727211
228892
362846
758003
883131
14033
389398
388749
638612
446540
562116
1048805
263348
610709
21993
842721
988942
441241
2922
688800
734667
463280
797829
363810
544010
6127
958317
540598
377877
1186228
349198
123976
169438
353706
908544
597031
648190
1198654
1156933
69896
295297
432219
1048677
86630
860009
575377
239511
1155554
680227
216498
1241158
844385
1158657
222374
1128751
250416
271386
976009
367145
273491
1265606
402918
190503
916922
762977
659374
1108321
1046235
106492
328764
21168
68360
166254
341766
612863
132406
404010
129617
530284
981296
813105
944194
264689
357591
542417
1237310
122779
972785
945770
238458
434185
919484
514156
666782
774527
453992
928687
1061622
1132317
591503
65726
1020359
495383
5805
481372
107857
1261709
228395
28965
93161
350172
717399
527438
83376
760809
31749
927425
312961
652161
778968
667265
979268
662360
1196855
1168761
266120
315205
1261911
479062
663533
821857
791979
999154
188995
1114818
126468
375525
421186
1209596
346105
652335
388425
1118456
1169032
1165773
681612
683625
943451
225095
1114123
955607
334179
165674
786870
535403
751410
424918
141631
386994
65081
1273265
992857
41745
750110
676040
264476
307422
1192036
541877
1204419
748006
1253228
678110
294323
835083
736885
1013941
908744
645105
669224
1253756
1150119
1158153
1030307
106546
193359
1113583
672751
524138
128487
1194607
446082
866203
778165
136078
178417
89787
31708
31494
722893
628990
548245
508024
680597
301026
791570
1193673
831230
574613
85561
751895
411927
617410
863311
715815
406894
548583
1111793
464268
669346
541521
565585
837510
798390
172922
1151756
76179
611601
616939
460864
1125714
310848
762529
100421
56285
304308
417803
459840
690574
720481
1266442
644640
830039
324887
460286
371010
244131
400753
121416
208199
1016363
1046789
366362
763585
354099
1088549
336946
46113
1177127
927957
858757
732777
1229703
834531
780761
1217680
729183
286497
539564
985072
161979
749822
1074549
29275
810004
1199320
2366
1122710
185175
367432
1005034
989684
901405
604505
1273058
877469
362844
923659
793457
966171
152512
793399
823493
916075
848042
945542
261090
132614
731357
1243482
38193
1020620
438352
33030
298775
184643
873197
481295
891071
424300
936608
853627
473788
893465
249330
705603
233370
74184
1028709
575189
112926
810162
439288
200184
21542
614127
1130842
1189113
435777
372959
395783
869711
1158940
1136500
154292
397186
1100548
362600
746576
843091
153278
395112
930281
7531
197865
629248
832032
420428
1194290
1115844
345124
833977
1070571
1221320
540335
387525
564169
146341
999633
643944
895977
1215132
665460
1173623
952611
535045
915668
284323
557089
916940
128690
739284
943960
350942
996450
257400
842696
832141
351399
186663
196938
1000890
242084
1209309
601035
69340
1015017
1233002
774141
200264
10242
252779
65931
576459
69240
117594
690325
718274
633118
573629
1259714
1029823
183528
279465
830384
517510
661871
1103096
633107
735900
739427
1152307
99188
1203897
932755
197353
571959
893722
680533
747297
1240292
608519
335355
256512
465575
510707
1153449
898058
257476
435082
33233
483444
487352
36865
199958
1000887
801867
1116206
925020
1200054
125863
525071
864875
390420
976494
836256
690822
897181
1106130
307924
610356
1262992
38724
186301
581936
706964
901754
598635
970231
645950
734716
58953
416625
145344
589909
1212204
1267611
1139779
968113
403927
926331
851405
1261377
106440
968444
960822
110842
392859
24417
223602
350514
433364
485511
1193133
226183
1249101
669781
1051086
528267
1163100
439942
611011
129512
352077
482085
101368
23115
589475
101879
921621
505568
1059022
1273610
287290
158011
1131245
494157
278629
799764
329250
622646
76122
331917
829988
56356
957199
764798
650949
280059
1024319
760515
912910
581424
558841
723839
940104
936291
1232273
648465
663597
1083122
1273249
91501
206141
463371
1236781
1019003
426201
829263
1189833
884859
75153
91389
681823
582851
170682
1040610
1019921
1221853
584023
171460
364472
480292
1196093
292283
808803
1183554
855468
561394
534465
673197
1167949
551421
1203090
1070989
1114540
88758
998175
534212
119448
235082
624645
979864
1042173
129169
898853
965175
1273285
922802
1156296
590000
844509
374304
630030
102810
1254469
1246276
991709
983180
1103154
938401
36800
399293
664322
465381
206978
713990
688402
733224
136494
978326
654781
31086
181587
459720
752575
206514
946909
696625
54635
795233
786610
962903
625597
511173
323033
779932
110488
273655
490093
1202157
602564
529873
242799
294267
190380
258895
342847
833445
846996
929644
1096410
1043984
394761
537341
705868
174620
103547
309457
486222
688431
99143
265005
658694
1115787
33145
753270
808300
883566
686688
433243
608343
125988
122513
284282
1257067
1173866
560335
299592
228316
1023909
969219
155414
227353
1205256
1211575
197355
1269562
112209
130502
879063
607161
1011593
698094
831737
241851
512031
491687
477366
830856
192242
637779
634627
739204
637144
768960
576673
284990
273852
102937
1144320
528070
1117866
631618
459490
758201
257284
1091317
415527
919060
447179
602278
895573
531635
157586
507788
247650
1209239
1199610
975404
817337
423849
696848
538246
623036
479307
645611
481077
982213
929579
787717
452950
707940
1235125
1267904
570914
1015084
944442
1264796
339959
63616
1098737
782108
1029118
556835
1251997
188412
412485
788510
1006797
1272886
447309
1198933
830193
1246136
435420
80473
183739
907424
676680
1231347
13368
952429
382177
598522
448755
476245
875091
677833
624343
786257
1205797
631920
284215
1147124
250829
498740
731029
1122062
150824
937107
674882
255367
804391
638224
526456
101932
666666
120247
225035
487765
763565
1001531
1174931
1205779
668349
865335
1150231
1239106
1142101
563674
1250556
439185
1060323
552625
898029
487838
1102290
1267926
112825
39301
519560
389104
1059648
190292
631218
338525
388443
210504
716881
1132327
1032284
1175212
273149
407984
246499
999176
421704
288250
407887
934826
251972
1094435
507382
678604
767155
1071548
174903
543780
804989
668067
1196516
81074
1030897
685272
220086
772824
157191
397210
53647
1221476
1072164
1254586
1123331
284663
761476
995639
861248
355219
895982
376140
1191834
583701
598853
450154
1080580
1146975
1171806
907516
913015
915103
605915
863440
1005385
783687
711049
160033
1269390
1210067
494484
1116445
973620
565130
448826
28881
318202
585245
776840
251582
92861
1261539
585003
1219592
721610
720530
409467
677231
1094895
104557
837263
449433
99888
954276
983449
224483
1076766
202117
661834
482903
325446
1061761
124925
991058
785575
720154
1230520
1200511
358890
272014
1241877
216522
794144
7710
737604
127479
837240
1029186
533644
764978
647190
1023383
849062
721638
173602
653617
8344
244037
725528
783419
1212698
1031586
431730
831798
517975
600203
430269
11625
16956
1165775
1012296
456065
694135
1171043
556788
1015745
896869
1106139
870583
936198
682570
15321
1171291
344014
445650
1035734
786815
387448
690621
1107364
1196667
406104
347276
907281
1067203
785527
1253533
1101552
573229
1238242
962036
754961
937273
23307
496316
1049304
349143
431944
283307
1157478
387073
1122752
397698
479611
951180
789365
111925
113939
1210241
31954
467270
1081265
697845
736479
1151191
1010400
1197785
48135
115325
481903
1191594
905064
438234
1159806
1237702
1062139
567448
1168071
759438
409099
294540
375328
308111
758477
442435
389973
38274
231317
960360
285499
376285
696212
821288
1276143
60978
580250
289030
1267246
1138981
15366
127596
323851
1127275
1127172
1054228
793572
471832
25990
330999
428044
272605
439088
1190639
271738
1051532
1161351
978057
582144
694417
771566
456902
491362
935558
1131567
1080266
583900
32173
404285
1187719
676411
582713
145486
296381
151221
295852
885349
273954
55232
846066
12141
624660
515379
1221324
1235320
119114
1030316
206387
65872
283216
701193
14615
405972
862240
474642
512402
438530
369723
927365
1128239
1275123
1243744
344770
1211945
231626
61223
1253050
237144
817893
786852
260763
41876
875135
818874
101439
194949
306502
226472
168699
841002
1080118
449171
941433
1015669
255895
964250
1044661
892800
596439
427949
16419
259125
1100007
849088
882455
442922
829952
915922
824710
513262
541267
27652
773476
11049
2281
1119628
163634
1079600
830766
818228
570461
1267262
3109
1240138
132940
841363
1077694
904292
1200721
863356
1020809
1232033
946811
950766
976207
124011
1019177
309857
1073157
534776
546410
1144975
978329
573290
1232786
1205061
841788
1148726
702456
389870
983772
292129
210562
677675
752456
1089099
668582
435993
1029311
684326
62862
621421
1014267
859834
440630
579309
744551
896741
748227
785172
1262239
1162946
1102186
773910
838119
279469
36066
265293
1248399
351200
331607
658134
1018800
528723
879803
1039577
675104
1024365
1271432
1043627
764706
328266
371560
69862
286292
1095066
697184
423871
1129275
1166631
330815
839336
617377
344254
505031
922194
98951
1016545
472798
245879
159728
324005
420389
843202
137280
32102
632435
1178538
731253
1083407
568722
1105592
767620
943677
45883
153013
642211
366221
710270
1119112
237649
889573
341963
1148490
465506
414858
456762
173599
730666
854247
997278
1068641
161002
1064064
569899
850238
694888
1136975
1156271
793785
192401
37564
753137
271287
1036947
923927
453604
842519
200243
717414
1204737
405370
812761
442511
1171593
1211754
266164
728812
561530
521590
926964
223996
786480
1077609
290016
1188631
1059130
966237
412256
196095
775176
15401
1242737
263832
807640
1083271
1037912
267805
871121
53535
7166
485677
510692
478510
488192
291741
574128
369841
950750
105208
1038122
741241
481798
116086
1250986
13185
790778
945556
623637
394774
602085
1197295
691819
1069010
1081412
368704
960331
665901
95935
1066942
557615
1153444
558532
952493
724479
1191349
825517
490735
46852
1048301
424738
1184318
1277046
172615
309239
1122629
487547
996674
716655
700238
959769
562673
161704
113578
1128577
85600
915923
302188
164975
1131493
1144920
988499
1059576
1270563
495762
1084125
726178
912564
1008526
1198483
368422
550935
438312
152146
803853
330004
553806
807655
242123
1222853
436600
6371
899258
703374
103864
386947
495936
814120
1025824
514320
962757
1067219
1234722
946832
1263258
949528
1090154
672444
454275
678430
740095
276560
1026046
1251812
378845
1082317
804951
322356
517925
849112
375046
474487
747011
751416
544464
1003883
127385
417160
126087
100249
1199778
698819
990367
169295
576437
1131971
1043709
665799
856982
723404
187723
1129290
940716
602617
221743
914604
689304
143579
249482
217196
1044675
659286
1201710
695297
903387
703648
532865
297331
60726
431038
1039579
1166015
784795
430692
104032
927460
130257
303968
295061
756801
661215
1194040
905138
1230084
90355
1012987
199162
561409
528037
566385
946857
311328
537894
339518
1154162
374964
47261
575338
1265984
880106
13153
1196756
265549
1165277
582904
22959
771550
741440
1262880
573673
275927
154800
1016719
384445
829752
633868
333044
1233498
656396
727721
1205026
935837
816422
422555
693789
1157791
923062
387476
574012
70129
830485
79177
1031677
960616
337637
445796
1229841
447038
526534
738626
766042
523597
1276730
600902
497051
400296
891499
351660
1103363
813749
789830
56589
446205
203751
1022805
888985
348310
224994
1140069
248920
538581
1020573
1262732
716317
1276566
529344
26226
745129
673550
697528
65658
459698
258844
1227123
856790
169620
662620
657527
36072
916131
788953
625947
67180
740418
410921
549249
93367
135124
588997
747488
375917
792458
960142
414910
569115
1142169
291793
889492
76581
1135966
722094
245484
1276373
941533
209786
482558
611071
1072054
377371
582314
1189245
439635
347377
202557
500886
969033
828080
889184
913652
868838
923770
276445
66046
374006
169917
89682
1054113
994494
980933
578967
903141
300361
35802
1249042
767659
132361
756183
263100
1017369
467255
218895
637579
1175724
223379
975720
255274
333576
1000981
19449
790502
950576
1030751
870828
452692
741035
753147
580552
44101
291036
349560
393541
168300
281877
104211
785457
98515
245059
1176114
708033
858247
269422
213166
1079673
554671
977511
357663
1061386
353277
545145
747999
136106
300603
368660
317951
903607
1131611
424348
351517
356948
918265
971229
321417
1054225
237603
293935
339353
1124729
618907
774234
1222497
380347
1152407
483285
1240168
1232304
229952
1195012
589324
910038
58973
1214560
115949
424686
208042
359753
672388
807560
992670
611460
335606
536952
90032
277644
683513
951903
1100805
243563
779970
827565
560290
966715
65951
31972
646523
8525
856454
240028
850916
775623
562101
293958
342466
871257
392285
101455
1213501
1206903
1059625
442950
463074
255023
66918
944671
1140190
1101791
819777
364763
1019466
688724
947406
913534
479231
699621
254270
759860
503045
348049
197215
544557
821421
716866
820058
522292
1062958
230051
546830
386420
1032491
165465
1080158
334417
312801
524189
352566
159069
640682
33633
575885
1261613
507173
1209363
632285
744275
903795
1242000
417031
545700
560032
168514
1099511
836943
254905
121301
836548
1075113
825760
9887
68797
927672
1250139
758800
1080870
151345
22190
67160
1083687
401910
361185
339526
1090351
381752
964016
5695
336139
478349
286752
300976
1114119
560618
128744
78392
419839
907200
681700
1173199
1039455
343294
874026
821595
1079221
96438
174881
42998
441851
1195556
1022136
83886
399962
380773
864898
585337
515150
702731
383790
898004
862690
1062628
174490
155750
1108006
116752
162012
1203908
654453
379284
590409
91734
801504
439312
702666
773248
421417
665763
1204907
724595
53297
226349
873018
101882
864191
1256109
1012597
679512
289301
672268
1057184
99032
305351
425234
312260
999918
560783
654538
1210688
760773
839766
522540
522518
533140
564953
1034520
41483
426773
171721
541018
911176
1165537
22363
54236
115830
77398
981032
654530
544455
908651
1191478
733233
89691
752894
315284
1002233
347565
1088444
1090666
913869
1168938
798574
1218563
993668
76491
140402
192388
1234819
570770
909614
1111926
736892
673921
801563
1141435
491298
371224
781281
83098
70327
244323
1180951
620291
530335
485072
429658
1085802
1254096
967895
379822
348722
844540
178772
504991
470363
200940
49628
1197598
667268
60855
463806
73541
818330
13402
593714
1087918
209210
754750
277944
957273
582727
932699
928986
350070
818982
876292
415279
204601
803971
1178969
81860
1158078
295525
507361
631148
1035081
658067
427762
457842
1043079
667826
37776
366189
730415
1039539
264536
1110352
113871
128539
132882
1014983
264082
120653
533449
874098
1073849
942298
959841
13523
75862
9003
1130368
78024
590388
1144855
906970
1192900
622397
344346
529602
87376
1054044
756517
945479
501293
116226
986610
1234450
620418
335414
1028236
1059520
614607
298570
403596
652433
690528
286879
1143011
1270901
286293
327948
179072
988879
732791
383303
1247801
530278
30367
879691
1055469
119903
700073
248266
1199611
237979
877551
695382
211844
464155
1258141
734618
404874
431273
615827
451881
108095
311898
156415
631694
759873
181670
982822
171474
1094654
310946
864525
78153
712573
1021630
180648
122668
1132919
1264206
387914
134532
609119
1223572
448151
58305
520408
190007
696150
1139538
883587
493484
493773
563776
404995
10188
922199
378068
912309
1010322
859796
53879
988129
416146
236999
147390
908264
502844
556548
1279559
746375
861408
310715
784191
570899
615033
622165
1222137
417567
771103
351795
415852
580695
656755
24479
884640
17497
912509
418378
38978
869069
170538
969248
1217375
361777
877839
831878
1037032
525127
460708
1052757
806835
12333
542992
106800
1188224
561761
366387
341104
533665
783605
1248405
227370
517635
889249
791616
123075
243989
977052
561328
964684
149658
914478
1150772
236771
386412
1182355
706238
615556
491162
643302
854024
1236697
722549
715224
755166
184659
674694
17989
262828
166770
265062
322255
954529
760679
748018
569796
934229
74081
166394
1137528
536858
100765
830293
857928
555314
248697
1107836
1212407
25045
665046
494605
336332
847112
1189150
652298
1226080
840466
1159094
1146519
749032
1242416
643003
345154
172797
574061
502466
310550
420024
1266007
1044918
87541
992805
74375
1058485
378439
29964
103479
845138
696196
652097
1054439
1127702
668442
1077493
631411
468553
776296
665114
139809
245435
1055697
1025178
650128
169960
413029
780648
222808
285089
692149
910464
339979
616299
998371
1133779
272959
89023
1132352
574052
1023330
478425
325689
767146
9568
148186
431713
165423
337668
398561
1013253
609214
99007
641059
273751
461430
589702
875223
805940
167881
12479
78329
704068
119103
1081305
856802
1014307
11046
454328
320197
1012102
439646
854503
989232
1255501
1175362
727461
86177
100264
395619
1199853
470439
931720
808390
255771
343196
687248
913693
92121
249837
1065319
727695
995174
692376
540117
645691
254646
978048
455043
1264524
178289
54701
430238
791032
281432
632079
1012323
889127
1197351
1233952
288788
386122
640040
601707
146878
1171042
603028
990623
990364
255319
775373
487567
604370
140644
1258177
288694
997672
544477
637880
1242522
248589
453340
344042
656899
930575
529649
261405
596968
337846
554082
263947
920765
62601
519796
291723
230614
1210298
72726
571388
495200
1078637
123729
950263
1242324
1178937
624819
849720
887405
993437
48990
224317
315984
250508
1191481
1176434
1177325
1219092
212058
295170
365206
424096
184463
168702
838895
277849
1077354
887295
319189
1008631
342956
502070
477057
46632
1251322
1055330
334947
838842
473672
1070074
1268093
1211411
1216342
1187580
329061
627415
100026
1030549
353729
325514
847849
943857
264628
159979
1232615
764222
709144
1096529
571046
986090
942624
63438
1258617
943826
1136590
1115234
843908
1014410
23429
868251
1274318
1225309
1031432
201424
951813
1109860
84611
209134
894550
1230062
342468
615116
206028
146407
696384
1132632
175320
19081
350457
1064394
655818
952205
146505
660251
1201715
322968
1253454
730879
161023
129297
1033181
1038474
1146383
155123
913046
304353
638528
1130066
427569
688010
722848
1092623
47371
842060
735467
924085
206704
978427
965567
533515
764444
1010012
959753
749244
715883
180204
893325
1263085
458053
1263776
712914
724092
1162467
116645
458922
299412
808403
206945
709990
690862
1147269
69161
987946
34286
987607
1130735
328770
411648
1066992
479248
1087585
699942
425645
69103
912747
319628
942778
632970
979255
204619
806353
599889
194203
110217
338107
466649
1184944
991824
600346
1015357
146822
202573
789087
787171
583011
1182415
1189819
719983
1042237
1177070
868604
1203332
404009
152764
715243
456292
1200112
582821
1065977
273018
1039430
693090
275542
1169457
537574
80519
782789
564217
650833
125436
975311
215386
314631
584140
67566
9525
175159
639295
980190
646540
339424
111545
1219106
215331
703353
943049
114584
1247962
738093
44202
50696
610351
40669
764911
719531
1018635
66932
912506
583072
1194975
1271688
37544
1136616
431374
1116772
1115218
309689
447287
834763
474435
400007
821673
694180
615063
727296
767981
110325
670140
812369
936310
325638
493734
1138570
909228
1025906
914783
325132
730023
505109
1160048
30444
52900
855421
927433
201727
304205
836827
869116
59039
1111108
155677
612014
721442
889219
845928
241916
604396
350016
270097
825744
830198
271777
654307
825577
755610
1023347
173887
1243787
373282
405625
123733
732181
883811
917504
638262
1227364
452234
340316
205726
457378
883354
1092239
846983
1224455
956558
503111
376576
949427
420162
918314
180060
263483
1035608
281753
849663
474544
1218245
275889
91776
163759
42815
220420
811899
343671
455959
1270390
900780
1006781
493296
820704
645761
568118
845690
263176
780953
644427
351754
1243998
1004614
70382
6382
1277369
902897
1044332
525235
204976
254428
1042000
268682
193718
615579
201405
131273
1238896
477804
1198004
286251
305575
370134
182330
1231290
43449
943319
579664
1003927
239508
1268547
912474
789399
1181831
748798
1239563
195700
902319
394526
174860
1255177
674164
1235619
245350
1191112
193601
658162
1274503
382864
1123491
487897
855954
545031
1114925
851173
800758
1046871
1233365
936088
1165549
1169780
696473
991758
503549
170508
764543
999654
1276130
907783
405349
82203
148073
567387
609328
853396
238350
235997
445218
923135
1060686
171767
556589
644712
987099
785425
493556
705351
1223427
768439
833057
1277184
1078192
1117434
740006
499376
1197478
729151
495241
126891
912949
969964
969265
827944
1003758
494239
958139
727954
782805
840522
881873
435460
188089
1129827
1235309
2732
805193
12097
714978
218734
583215
927013
1100255
946008
673394
864084
252286
765081
759592
974472
710966
851845
126454
160287
1249058
208385
1186211
582755
714189
187037
975638
891572
480610
705145
115605
803831
268537
841307
958946
1225374
35266
575205
967562
652472
517469
1117462
804094
806852
1074136
944601
817044
106694
530406
152306
675533
531622
23627
142193
418161
1275448
131698
505293
175496
1065342
47648
37223
870247
574370
1080416
686652
1189315
1133418
655918
118117
381654
1115357
669656
198885
1024687
395471
859282
277171
951389
222056
1273372
666177
974445
1089544
372608
975821
524021
778474
132514
290616
859879
359239
174092
349063
666801
668632
69959
1247804
657548
391007
896525
455910
280500
591901
400858
822512
35859
1183473
425685
523427
1133315
865142
1135820
573843
100764
672851
119677
530218
416832
991642
668212
1194809
455550
819109
1032353
550094
969073
1070605
1188752
755955
59627
406893
76952
330064
1245733
701146
31048
1034999
1051896
863015
697190
176542
495427
1035456
1182011
834256
954758
1014562
854888
703894
960917
428121
672715
60758
870861
175374
790525
372285
46537
464075
523818
537280
556812
1156787
141180
272641
780261
946040
1202570
338949
896051
251230
1144961
1002590
777618
952509
369083
655343
16163
1054319
450279
496829
494458
654145
218878
34362
1077373
179315
374751
1060937
487438
645651
979778
990205
1151982
899070
469624
595905
331797
122027
872623
1167816
235599
755300
43062
1146685
982515
781403
1088934
529605
370709
1173936
75941
181901
272815
1175547
1145286
1210811
632129
435242
528668
512606
1222157
255778
728787
163395
901578
428265
521331
998117
941983
658239
188396
174565
165028
378725
358739
955569
632760
12345
76687
687536
1276521
1017445
971310
288820
379398
290063
578298
1200023
685996
1169018
521449
334864
713121
1276202
618436
190464
709291
1275906
16303
986584
644471
196946
376684
639496
617016
224736
1121268
486921
598459
1269457
1145680
215335
1134164
815072
988798
767665
552205
1085811
303136
995431
131604
758734
885097
577694
193961
854619
412339
631533
604803
515675
343743
547827
903384
1217758
34803
142132
496963
624657
1085632
190247
607146
902497
1190452
968456
1240491
33947
1148101
133531
1073607
43865
1077659
35824
322162
128048
207175
654060
408140
1156583
388597
571726
228186
1005612
1012536
1182101
880686
839255
1011366
1171666
529913
652118
1204485
831803
76258
301977
874947
20755
324899
490060
248524
233687
148335
140843
474610
296474
1250262
1086433
616609
485839
476347
1182240
1190986
1065827
811924
704393
790368
1018161
1125763
11114
819389
1062542
379303
1138556
226010
176957
869170
308690
36770
373220
680217
109236
77031
1242205
878058
151625
622215
578235
614854
1167072
426715
495458
948473
1194382
1262552
1241311
222523
990092
939604
24393
764180
180266
1004316
1220953
713911
862771
880593
265506
283959
327737
325176
201186
302083
511867
1018895
392230
70322
72555
594333
946221
560016
1126789
714808
909429
741443
528033
310620
556830
1001548
146960
487262
1258087
782292
325725
290669
892431
450835
17052
1260636
688123
228850
269173
927141
37263
441797
1259645
635922
577466
1138292
524183
390901
2011
59566
233278
419386
992706
803762
520522
1069169
1129871
407809
778672
68119
8867
225452
385145
1134520
1230222
543362
281403
305197
467407
689066
285010
1049986
784554
375642
18140
185144
38999
53952
692831
10460
916825
42276
280823
470562
1270407
880720
988988
796624
364084
836296
976797
138531
111028
1020830
42673
11236
440310
383081
1254566
1038475
1200536
32645
211249
869091
1158678
296966
1116289
93290
1026297
1217368
130778
426032
665635
195941
523310
264751
995415
482834
602143
1118047
130463
963831
369951
998262
242135
1241364
954541
515812
675660
797986
1183280
64963
843469
31313
1163539
394010
742201
1203962
219852
568262
1064721
616202
609073
680321
1171306
6012
1005302
1044682
360315
74751
336157
637153
348663
976984
128595
696569
410290
747310
1028962
42084
785533
226561
921078
265688
682955
78851
240278
121620
438968
945855
340371
348605
1111619
1056669
145048
1201965
638480
767245
930498
984234
292480
1251959
16099
160212
835952
539165
898847
26348
77612
422023
54422
372894
935980
357371
500347
257556
490620
859538
627663
889622
359029
320307
149086
154155
230624
83978
1142696
1129442
142305
474899
739636
1020478
553023
356681
1024610
362779
35216
379730
559236
916909
42455
1126059
444511
244356
106561
908312
711507
1260140
801308
1172449
837601
564393
1094382
576871
1006928
404535
392606
448148
1068182
857175
275067
1101318
682862
403368
1162677
1174091
72642
1132425
633375
1262722
400094
999915
1046495
1123050
1082153
1243137
1263939
165321
1210626
1115385
1013557
894419
681500
1105753
912630
932884
264381
934061
121152
687594
1032943
20392
568064
1264358
1046592
885589
710142
929927
489012
493523
897641
922481
987595
850300
1064575
424209
284635
1021765
368833
1071475
620352
991365
950858
1004156
1067181
267557
541463
1242255
820534
711643
455841
599185
835518
979950
683190
1155497
1018780
37879
1053254
1147189
855086
336994
1095442
1136961
907731
1067808
581310
563879
803740
341416
349314
325863
819375
375849
742170
177417
260406
48285
160437
1044446
1111350
196052
985897
342536
892008
1157823
620593
144005
1029655
1037466
30924
491282
310362
835989
596191
646751
473504
459578
540789
150178
1040378
975985
1216839
1235758
231320
905165
835910
145945
386228
186734
561316
237382
114395
800650
241062
804365
592426
685144
396431
278311
487818
976550
1251754
152869
1006803
1051377
728856
1200896
399035
655138
1192887
1276169
405082
574923
374960
623805
1078737
146133
1013455
1235237
426497
612177
889333
983982
1018204
1082871
261501
710565
441563
555573
745052
882006
772244
729529
130543
184593
400844
560670
819146
395056
586664
6467
893536
1176501
1256400
1134560
916107
244793
161691
975137
551889
1111834
119641
377549
100905
1226134
1063116
672368
626811
488417
892608
476071
875312
201010
109791
418018
539902
353043
535449
153944
169263
746029
352993
512580
111271
818185
851165
877169
1160131
428316
960610
745688
1149821
1159749
262485
382218
988817
996852
573140
1041630
1135951
1043751
674501
575287
646784
667407
439184
1199653
209960
836854
863486
1097038
1129847
929257
819975
588386
253186
14307
676286
258590
733728
1068027
53300
377245
821581
1093436
1256662
1164780
465617
260398
46024
341633
722716
898705
1271098
526710
726581
238865
576098
620466
970557
1008351
436229
200046
1118153
1181183
22080
656197
1199579
270287
317764
1054700
459504
744514
647177
74541
738871
418518
901548
931971
944562
565522
877814
316158
1036759
861803
214524
284913
84004
600425
387518
977949
824416
1092808
609205
283457
975416
656996
653085
836831
238783
1062095
810746
1268420
707399
602038
96901
858227
1208158
1204309
208083
1108784
582572
293223
1144056
808332
510796
183649
1069927
933419
789945
241437
314047
489277
729310
364275
639371
1068760
650590
534823
586953
713436
839094
970848
300291
514309
396147
555665
308515
1212837
707027
235716
999203
448707
1271289
384034
292593
159120
34039
1151468
662600
9437
556259
871233
5582
1243502
347982
90632
322187
302493
783017
324888
27029
287189
707227
79081
559581
964654
498548
407004
947387
28386
83646
654660
475976
295891
689961
902651
1202158
207414
911166
93759
409638
205823
1013291
945009
